WELCOME_TEXT = """❗️<b>Лонг на ПЛОТИНКЕ DH | Воскресенье 8:30 | 20 км | группы: 4:00–6:00 | Б. Ельцина, 3 (Ельцин Центр)</b>

Друзья, мы рады приветствовать вас в боте сообщества «Лонг на ПЛОТИНКЕ DH».

<i>Это название пилотное, так как мы стремимся стать частью движения DIEHARD.</i>

Пробежки <b>бесплатные</b> и проводятся каждое воскресенье.

<b>ТРАССА 🛣</b>
20 км, организованные в 3 круга по ≈6,7 км. Это большой плюс для новичков и продвинутых бегунов: каждый может скорректировать километраж под свои задачи.

<b>ГРУППЫ ПО ТЕМПУ ⏱</b>
У нас есть пейсмейкеры, которые ведут группы и поддерживают ровный темп на протяжении трёх кругов.

<b>Темпы групп:</b> 4:00 · 4:30 · 5:00 · 5:30 · 6:00 мин/км

<b>Время старта:</b> каждое воскресенье в 8:30.

<b>Точка старта:</b> ул. Бориса Ельцина, 3, Ельцин Центр.

Для вступления в группу необходимо ознакомиться с правилами сообщества."""

RULES_TEXT = """📋 Несколько важных правил

Пожалуйста, прочитайте их, чтобы наши пробежки проходили комфортно и организованно.

1. Переодеваемся в туалетах Ельцин Центра, а не в кафе «Слойка».

2. Утром заходим в кафе с левой стороны — там, где нет ограничительной ленты.

3. Во время пробежки движемся организованной колонной, не более трёх человек в ряд. Так мы не мешаем другим бегунам и прохожим.

4. Бежим строго за пейсмейкером своей группы и не выбегаем вперёд. Иначе пейсмейкеру становится сложнее поддерживать ровный темп для всей группы.

Нажимая кнопку ниже, вы подтверждаете, что прочитали правила и согласны их соблюдать.
"""

CAPTCHA_TEXT = """✅ Правила приняты.

Остался один небольшой шаг. Ответьте на простой вопрос:"""

CAPTCHA_WRONG_TEXT = "Неверный ответ. Попробуйте ещё раз."

JOIN_APPROVED_TEXT = """🎉 Всё верно!

Ваша заявка одобрена. Добро пожаловать в беговой чат Diehard!"""

JOIN_REQUEST_MISSING_TEXT = """Не получилось одобрить заявку. Возможно, она уже отозвана или обработана. Подайте заявку на вступление ещё раз."""
